{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "ai4bharat/indictrans2-en-indic-1B",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "target_modules": [
    "v_proj",
    "k_proj",
    "q_proj"
  ],
  "task_type": "SEQ_2_SEQ_LM"
}